       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWOLRD.
      ***************************************************
      * AUTHOR = BATISTA
      * DATA = 23/12/2024
      ***************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION. 
       PROCEDURE DIVISION.
           DISPLAY 'Hello World!'.
           STOP RUN.
